Configuration/Documents/бит_ум_КвитанцияЗаПатент.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>бит_ум_КвитанцияЗаПатент</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.бит_ум_ОплатаПатентов</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФизическоеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВходящегоДокумента</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерВходящегоДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачалоПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоМесяцев</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

Configuration/InformationRegisters/бит_ум_ДокументыИР.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>бит_ум_ДокументыИР</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Серия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Номер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДопПоле</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СрокДействия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Архив</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТерриторияДействия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ГосударственныйОрган</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ум_ГосударственныеОрганы</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаВыдачи</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДопПоле2</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Примечание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Физлицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ум_ВидыДокументовИР</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Configuration/AccumulationRegisters/бит_ум_ОплатаПатентов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>бит_ум_ОплатаПатентов</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ФизическоеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПериодВзаиморасчетов</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Configuration/Documents/бит_ум_КвитанцияЗаПатент/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ПрограммныйИнтерфейс	
	
// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати.
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
КонецПроцедуры

// Формирует печатные формы.
//
// Параметры:
//  МассивОбъектов  - Массив    - ссылки на объекты, которые нужно распечатать;
//  ПараметрыПечати - Структура - дополнительные настройки печати;
//  КоллекцияПечатныхФорм - ТаблицаЗначений - сформированные табличные документы (выходной параметр)
//  ОбъектыПечати         - СписокЗначений  - значение - ссылка на объект;
//                                            представление - имя области в которой был выведен объект (выходной параметр);
//  ПараметрыВывода       - Структура       - дополнительные параметры сформированных табличных документов (выходной параметр).
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
КонецПроцедуры

// Заполняет список текущих дел пользователя.
//
// Параметры:
//   ТекущиеДела - ТаблицаЗначений - таблица с колонками:
//     * Идентификатор           - Строка - внутренний идентификатор дела, используемый механизмом "Текущие дела".
//     * ЕстьДела                - Булево - если Истина, дело выводится в списке текущих дел пользователя.
//     * Важное                  - Булево - если Истина, дело будет выделено красным цветом.
//     * Представление           - Строка - представление дела, выводимое пользователю.
//     * Количество              - Число  - количественный показатель дела, выводится в строке заголовка дела.
//     * Форма                   - Строка - полный путь к форме, которую необходимо открыть при нажатии на
//         гиперссылку дела на панели "Текущие дела".
//     * ПараметрыФормы          - Структура - параметры, с которыми нужно открывать форму показателя.
//     * Владелец                - Строка, объект метаданных - строковый идентификатор дела,
//         которое будет владельцем для текущего или объект метаданных подсистема.
//     * Подсказка               - Строка - текст подсказки.
//
Процедура ПриЗаполненииСпискаТекущихДел(ТекущиеДела) Экспорт
	
    Если НЕ ПравоДоступа("Изменение", Метаданные.РегистрыНакопления.бит_ум_ОплатаПатентов) Тогда
        Возврат;
	КонецЕсли;	
	
	Если НЕ ПолучитьФункциональнуюОпцию("бит_ум_УчетПатентов") Тогда
		Возврат;
	КонецЕсли;
	
	МодульТекущиеДелаСервер = ОбщегоНазначения.ОбщийМодуль("ТекущиеДелаСервер");
	
	Если МодульТекущиеДелаСервер.ДелоОтключено("УМПросроченныеПатенты") Тогда
		Возврат;
	КонецЕсли;
	
	ПредупреждениеОбОплатеПатентов = бит_ум_УчетМигрантовПовтИсп.ПолучитьКонстантуИзНастроек("ПредупреждениеОбОплатеПатентов");
	Если НЕ ЗначениеЗаполнено(ПредупреждениеОбОплатеПатентов) Тогда
		Возврат;
	КонецЕсли;
	
	Дело = ТекущиеДела.Добавить();
	Дело.Идентификатор = "УМПросроченныеПатенты";
	Дело.Представление = НСтр("ru = 'Подходит срок оплаты патентов'");
	Дело.Владелец = Метаданные.Подсистемы.УчетМигрантов;
	
	МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	
	Запрос.УстановитьПараметр("Период", ТекущаяДатаСеанса());
	Запрос.УстановитьПараметр("ПредупреждениеОбОплатеПатентов", ПредупреждениеОбОплатеПатентов);
	                  
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ДокументыИР.Физлицо КАК ФизическоеЛицо
	|ПОМЕСТИТЬ ВТФизическиеЛица
	|ИЗ
	|	РегистрСведений.бит_ум_ДокументыИР.СрезПоследних({(&Период)}, ВидДокумента = ЗНАЧЕНИЕ(Справочник.бит_ум_ВидыДокументовИР.Патент)) КАК ДокументыИР
	|ГДЕ
	|	ДокументыИР.Архив = ЛОЖЬ
	|	И (ДокументыИР.СрокДействия >= &Период
	|			ИЛИ ДокументыИР.СрокДействия = ДАТАВРЕМЯ(1, 1, 1))";
	
	Запрос.Выполнить(); 
	
	ПараметрыПолученияСотрудников =
		КадровыйУчет.ПараметрыПолученияСотрудниковОрганизацийПоВременнойТаблице();
	
	ПараметрыПолученияСотрудников.ИмяВТФизическиеЛица = "ВТФизическиеЛица";	
	ПараметрыПолученияСотрудников.КадровыеДанные = "ДатаПриема,ДатаУвольнения,Организация";     
	
	КадровыйУчет.СоздатьВТСотрудникиОрганизации(
		МенеджерВременныхТаблиц, Истина, 
		ПараметрыПолученияСотрудников,
		"ВТСотрудникиФизическихЛиц");
	
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ОплатаПатентов.ФизическоеЛицо КАК ФизическоеЛицо,
	|	МАКСИМУМ(ДОБАВИТЬКДАТЕ(ОплатаПатентов.ПериодВзаиморасчетов, МЕСЯЦ, 1)) КАК СрокОплаты,
	|	ВЫБОР
	|		КОГДА МАКСИМУМ(ДОБАВИТЬКДАТЕ(ОплатаПатентов.ПериодВзаиморасчетов, МЕСЯЦ, 1)) <= НАЧАЛОПЕРИОДА(&Период, ДЕНЬ)
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК Важное,
	|	ОплатаПатентов.Организация КАК Организация
	|ИЗ
	|	РегистрНакопления.бит_ум_ОплатаПатентов.Обороты(
	|			,
	|			&Период,
	|			,
	|			(Организация, ФизическоеЛицо) В
	|				(ВЫБРАТЬ
	|					ФизическиеЛица.Организация,
	|					ФизическиеЛица.ФизическоеЛицо
	|				ИЗ
	|					ВТСотрудникиФизическихЛиц КАК ФизическиеЛица
	|				ГДЕ
	|					(ФизическиеЛица.ДатаУвольнения = ДАТАВРЕМЯ(1, 1, 1)
	|						ИЛИ ФизическиеЛица.ДатаУвольнения >= &Период))) КАК ОплатаПатентов
	|
	|СГРУППИРОВАТЬ ПО
	|	ОплатаПатентов.ФизическоеЛицо,
	|	ОплатаПатентов.Организация
	|
	|ИМЕЮЩИЕ
	|	ДОБАВИТЬКДАТЕ(МАКСИМУМ(ДОБАВИТЬКДАТЕ(ОплатаПатентов.ПериодВзаиморасчетов, МЕСЯЦ, 1)), ДЕНЬ, -1 * &ПредупреждениеОбОплатеПатентов) <= НАЧАЛОПЕРИОДА(&Период, ДЕНЬ)
	|ИТОГИ
	|	КОЛИЧЕСТВО(ФизическоеЛицо),
	|	МАКСИМУМ(Важное)
	|ПО
	|	ОБЩИЕ,
	|	Организация";
	
	Результат = Запрос.Выполнить();
	
	Если Результат.Пустой() Тогда
		Дело.ЕстьДела = Ложь;
		Дело.Важное = Ложь;
		Возврат;
	КонецЕсли;
	
	Выборка = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Выборка.Следующий();
	
	Дело.ЕстьДела = Истина;
	Дело.Важное = Выборка.Важное > 0;
	Дело.Количество = Выборка.ФизическоеЛицо;
	
	ПараметрыНастроек = Новый Структура;
	ПараметрыНастроек.Вставить("Период", Новый СтандартныйПериод('00010101',  ТекущаяДатаСеанса()));
    ПользовательскиеНастройки = УстановитьПользовательскиеНастройкиОтчета("бит_ум_ВзаиморасчетыПоПатентам", ПараметрыНастроек);
	
	ВыборкаОрганизаций = Выборка.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаОрганизаций.Следующий() Цикл
				
		ДелоОрганизации = ТекущиеДела.Добавить();
		ДелоОрганизации.Идентификатор = "УМПросроченныеПатенты" + СтрЗаменить(ВыборкаОрганизаций.Организация.УникальныйИдентификатор(), "-", "");
		ДелоОрганизации.Представление = ВыборкаОрганизаций.Организация; 
		ДелоОрганизации.Владелец = "УМПросроченныеПатенты";
		ДелоОрганизации.ЕстьДела = Истина;
		ДелоОрганизации.Важное = ВыборкаОрганизаций.Важное > 0;
		ДелоОрганизации.Количество = ВыборкаОрганизаций.ФизическоеЛицо;
		ДелоОрганизации.Форма = "Отчет.бит_ум_ВзаиморасчетыПоПатентам.ФормаОбъекта";
	
		Отбор = Новый Структура;
		Отбор.Вставить("Организация", ВыборкаОрганизаций.Организация);
		Отбор.Вставить("ПодходитСрокОплаты", Истина);
		
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("СформироватьПриОткрытии", Истина);
		ПараметрыФормы.Вставить("КлючВарианта", "Основной");
		ПараметрыФормы.Вставить("ПользовательскиеНастройки", ПользовательскиеНастройки);
		ПараметрыФормы.Вставить("Отбор", Отбор);
		
		ДелоОрганизации.ПараметрыФормы = ПараметрыФормы; 
		
	КонецЦикла;
	
КонецПроцедуры

// СтандартныеПодсистемы.УправлениеДоступом
// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт
	
	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(Организация)";
	
КонецПроцедуры
// Конец СтандартныеПодсистемы.УправлениеДоступом

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция УстановитьПользовательскиеНастройкиОтчета(ТипОтчета,СтруктураПараметров)
	
    СтруктураНастроек = Новый Структура;
    ОтчетОбъект = Отчеты[ТипОтчета].Создать();
    
    ПользовательскиеНастройки = ОтчетОбъект.КомпоновщикНастроек.ПользовательскиеНастройки;
    Для Каждого ЭлПараметр  Из СтруктураПараметров Цикл
        Для Каждого ПараметрСКД Из ПользовательскиеНастройки.Элементы Цикл
            Если ТипЗнч(ПараметрСКД) = Тип("ЗначениеПараметраНастроекКомпоновкиДанных") Тогда  
                Если строка(ПараметрСКД.Параметр) = ЭлПараметр.Ключ Тогда 
                    ПараметрСКД.Значение = ЭлПараметр.Значение;
                    ПараметрСКД.Использование = Истина;
                КонецЕсли;
            КонецЕсли;
        КонецЦикла;    
    КонецЦикла;
        
    Возврат ПользовательскиеНастройки;
	
КонецФункции

#КонецОбласти
	
#КонецЕсли
